Output from Terraform plan
```[command]/home/runner/work/_temp/f67d524f-670e-4dc0-a490-dcee35a27da1/terraform-bin plan -refresh=false -no-color -out=plan
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.automation_account["nomis-bip-t1"].azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account"
        name                     = "nomis-bip-t1-automation-account"
      ~ tags                     = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
        # (6 unchanged attributes hidden)
    }

  # module.automation_account["t1-oasys"].azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account"
        name                     = "t1-oasys-automation-account"
      ~ tags                     = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
        # (6 unchanged attributes hidden)
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_account.automation_account will be created
  + resource "azurerm_automation_account" "automation_account" {
      + dsc_primary_access_key   = (known after apply)
      + dsc_secondary_access_key = (known after apply)
      + dsc_server_endpoint      = (known after apply)
      + id                       = (known after apply)
      + location                 = "ukwest"
      + name                     = "t1-prisonnomis-automation-account"
      + resource_group_name      = "t1-prisonnomis"
      + sku_name                 = "Basic"
      + tags                     = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_job_schedule.job_schedules["0"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "t1-prisonnomis-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "t1-prisonnomis"
      + runbook_name            = "start-vms"
      + schedule_name           = "weekdays 6am"
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_job_schedule.job_schedules["1"] will be created
  + resource "azurerm_automation_job_schedule" "job_schedules" {
      + automation_account_name = "t1-prisonnomis-automation-account"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + resource_group_name     = "t1-prisonnomis"
      + runbook_name            = "stop-vms"
      + schedule_name           = "weekdays 7pm"
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["start-vms"] will be created
  + resource "azurerm_automation_runbook" "runbooks" {
      + automation_account_name = "t1-prisonnomis-automation-account"
      + content                 = <<-EOT
            workflow start-vms
            {   
                # vars
                $resourceGroup = "t1-prisonnomis"
                $sequence_tag  = 'sequence_start'
                $delayBetweenGroups = "180"
                
                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation
                Connect-AzureRMAccount -Identity
            
                # get vm list
                $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup
                
                # remove exceptions from vm list by shutdown_exclude tag
                $vms_to_handle = InlineScript {
                    $vms_in_rg = $using:vms_in_rg
                    $vms_to_handle = [System.Collections.ArrayList]@()
                    foreach ($vm in $vms_in_rg) {
                        if ($vm.Tags.shutdown_exclude -ne 'true') {
                            $vms_to_handle += $vm
                        }
                    }
                    return $vms_to_handle
                }
                "vms to handle:"
                $vms_to_handle.Name
                ""
            
                # create ordering groups
                $ordered_vms = InlineScript {
                    $vms_to_handle = $using:vms_to_handle
                    $sequence_tag  = $using:sequence_tag
                    # add groups
                    $ordered_vms = [ordered]@{}
                    $ordered_vms['0'] = [System.Collections.ArrayList]@()
                    foreach ($vm in $vms_to_handle) {
                        if ($vm.Tags[$sequence_tag] -match '^\d+') {
                            $ordered_vms[$vm.Tags[$sequence_tag]] = [System.Collections.ArrayList]@()
                        }
                    }
                    # add vms into groups
                    foreach ($vm in $vms_to_handle) {
                        if ($vm.Tags[$sequence_tag] -match '^\d+') {
                            $ordered_vms[$vm.Tags[$sequence_tag]] += $vm.Name
                        } else {
                            $ordered_vms['0'] += $vm.Name
                        }
                    }
            
                    # sort groups
                    $ordered_vms = $ordered_vms.GetEnumerator() | sort -Property Key
                    return $ordered_vms
                }
                "sequence groups:"
                foreach ($group in $ordered_vms) {
                    $group.Name
                    foreach ($vm in $group.Value) { 
                        $vm
                    }
                    ""
                }
                
                # iterate over vms
                foreach ($group in $ordered_vms) {
                    # there is duplication because i wasted too much time trying to put -parallel as a variable and splatting in. Powershell problems...
                    # 'Splatting is not permitted in workflow activities or in calls to workflows'
                    if ($group.Key -match '_series$') {
                        foreach ($vm in $group.Value) { 
                            InlineScript {
                                $vm            = $Using:vm
                                $resourceGroup = $Using:resourceGroup
            
                                # start vm
                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm
            
                                # update monitoring tag
                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags
                                $tags.not_monitored = "false"
                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force
                            } 
                        }
                    } else {
                        foreach -parallel ($vm in $group.Value) {
                            InlineScript {
                                $vm            = $Using:vm
                                $resourceGroup = $Using:resourceGroup
            
                                # start vm
                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm
            
                                # update monitoring tag
                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags
                                $tags.not_monitored = "false"
                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force 
                            }              
                        }
                    }
                    # add delay between groups
                    Start-Sleep -Seconds $delayBetweenGroups
                }
            }
        EOT
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "ukwest"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "start-vms"
      + resource_group_name     = "t1-prisonnomis"
      + runbook_type            = "PowerShellWorkflow"
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["stop-vms"] will be created
  + resource "azurerm_automation_runbook" "runbooks" {
      + automation_account_name = "t1-prisonnomis-automation-account"
      + content                 = <<-EOT
            workflow stop-vms
            {
                # vars
                $resourceGroup = "t1-prisonnomis"
                $sequence_tag  = 'sequence_stop'
                $delayBetweenGroups = "180"
                
                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation
                Connect-AzureRMAccount -Identity
            
                # get vm list
                $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup
                
                # remove exceptions from vm list by shutdown_exclude tag
                $vms_to_handle = InlineScript {
                    $vms_in_rg = $using:vms_in_rg
                    $vms_to_handle = [System.Collections.ArrayList]@()
                    foreach ($vm in $vms_in_rg) {
                        if ($vm.Tags.shutdown_exclude -ne 'true') {
                            $vms_to_handle += $vm
                        }
                    }
                    return $vms_to_handle
                }
                "vms to handle:"
                $vms_to_handle.Name
                ""
            
                # create ordering groups
                $ordered_vms = InlineScript {
                    $vms_to_handle = $using:vms_to_handle
                    $sequence_tag  = $using:sequence_tag
                    # add groups
                    $ordered_vms = [ordered]@{}
                    $ordered_vms['0'] = [System.Collections.ArrayList]@()
                    foreach ($vm in $vms_to_handle) {
                        if ($vm.Tags[$sequence_tag] -match '^\d+') {
                            $ordered_vms[$vm.Tags[$sequence_tag]] = [System.Collections.ArrayList]@()
                        }
                    }
                    # add vms into groups
                    foreach ($vm in $vms_to_handle) {
                        if ($vm.Tags[$sequence_tag] -match '^\d+') {
                            $ordered_vms[$vm.Tags[$sequence_tag]] += $vm.Name
                        } else {
                            $ordered_vms['0'] += $vm.Name
                        }
                    }
            
                    # sort groups
                    $ordered_vms = $ordered_vms.GetEnumerator() | sort -Property Key
                    return $ordered_vms
                }
                "sequence groups:"
                foreach ($group in $ordered_vms) {
                    $group.Name
                    foreach ($vm in $group.Value) { 
                        $vm
                    }
                    ""
                }
            
                # iterate over vms
                foreach ($group in $ordered_vms) {
                    # there is duplication because i wasted too much time trying to put -parallel as a variable and splatting in. Powershell problems...
                    # 'Splatting is not permitted in workflow activities or in calls to workflows'
                    if ($group.Key -match '_series$') {
                        foreach ($vm in $group.Value) { 
                            InlineScript {
                                $vm            = $Using:vm
                                $resourceGroup = $Using:resourceGroup
            
                                # update monitoring tag if it exists
                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags
                                $tags.not_monitored = "true"
                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force 
            
                                # stop vm
                                Stop-AzureRmVM -ResourceGroupName $ResourceGroup -Name $vm -Force
                            }
                        }
                    } else {
                        foreach -parallel ($vm in $group.Value) {
                            InlineScript {
                                $vm            = $Using:vm
                                $resourceGroup = $Using:resourceGroup
            
                                # update monitoring tag if it exists
                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags
                                $tags.not_monitored = "true"
                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force 
            
                                # stop vm
                                Stop-AzureRmVM -ResourceGroupName $ResourceGroup -Name $vm -Force
                            }
                        }
                    }
                    # add delay between groups
                    Start-Sleep -Seconds $delayBetweenGroups
                }
            }
        EOT
      + id                      = (known after apply)
      + job_schedule            = (known after apply)
      + location                = "ukwest"
      + log_progress            = true
      + log_verbose             = true
      + name                    = "stop-vms"
      + resource_group_name     = "t1-prisonnomis"
      + runbook_type            = "PowerShellWorkflow"
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_schedule.schedules["weekdays 6am"] will be created
  + resource "azurerm_automation_schedule" "schedules" {
      + automation_account_name = "t1-prisonnomis-automation-account"
      + expiry_time             = (known after apply)
      + frequency               = "week"
      + id                      = (known after apply)
      + interval                = (known after apply)
      + name                    = "weekdays 6am"
      + resource_group_name     = "t1-prisonnomis"
      + start_time              = (known after apply)
      + timezone                = "UTC"
      + week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
    }

  # module.automation_account["t1-prisonnomis"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be created
  + resource "azurerm_automation_schedule" "schedules" {
      + automation_account_name = "t1-prisonnomis-automation-account"
      + expiry_time             = (known after apply)
      + frequency               = "week"
      + id                      = (known after apply)
      + interval                = (known after apply)
      + name                    = "weekdays 7pm"
      + resource_group_name     = "t1-prisonnomis"
      + start_time              = (known after apply)
      + timezone                = "UTC"
      + week_days               = [
          + "Friday",
          + "Monday",
          + "Thursday",
          + "Tuesday",
          + "Wednesday",
        ]
    }

  # module.automation_account["t2-oasys"].azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account"
        name                     = "t2-oasys-automation-account"
      ~ tags                     = {
          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"
          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 7 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_automation_account.automation_account will be updated in-place%0A  ~ resource "azurerm_automation_account" "automation_account" {%0A        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account"%0A        name                     = "nomis-bip-t1-automation-account"%0A      ~ tags                     = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_automation_account.automation_account will be updated in-place%0A  ~ resource "azurerm_automation_account" "automation_account" {%0A        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account"%0A        name                     = "t1-oasys-automation-account"%0A      ~ tags                     = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_account.automation_account will be created%0A  + resource "azurerm_automation_account" "automation_account" {%0A      + dsc_primary_access_key   = (known after apply)%0A      + dsc_secondary_access_key = (known after apply)%0A      + dsc_server_endpoint      = (known after apply)%0A      + id                       = (known after apply)%0A      + location                 = "ukwest"%0A      + name                     = "t1-prisonnomis-automation-account"%0A      + resource_group_name      = "t1-prisonnomis"%0A      + sku_name                 = "Basic"%0A      + tags                     = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t1-prisonnomis"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 6am"%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t1-prisonnomis"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["start-vms"] will be created%0A  + resource "azurerm_automation_runbook" "runbooks" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + content                 = <<-EOT%0A            workflow start-vms%0A            {   %0A                # vars%0A                $resourceGroup = "t1-prisonnomis"%0A                $sequence_tag  = 'sequence_start'%0A                $delayBetweenGroups = "180"%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A                $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup%0A                %0A                # remove exceptions from vm list by shutdown_exclude tag%0A                $vms_to_handle = InlineScript {%0A                    $vms_in_rg = $using:vms_in_rg%0A                    $vms_to_handle = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_in_rg) {%0A                        if ($vm.Tags.shutdown_exclude -ne 'true') {%0A                            $vms_to_handle += $vm%0A                        }%0A                    }%0A                    return $vms_to_handle%0A                }%0A                "vms to handle:"%0A                $vms_to_handle.Name%0A                ""%0A            %0A                # create ordering groups%0A                $ordered_vms = InlineScript {%0A                    $vms_to_handle = $using:vms_to_handle%0A                    $sequence_tag  = $using:sequence_tag%0A                    # add groups%0A                    $ordered_vms = [ordered]@{}%0A                    $ordered_vms['0'] = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] = [System.Collections.ArrayList]@()%0A                        }%0A                    }%0A                    # add vms into groups%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] += $vm.Name%0A                        } else {%0A                            $ordered_vms['0'] += $vm.Name%0A                        }%0A                    }%0A            %0A                    # sort groups%0A                    $ordered_vms = $ordered_vms.GetEnumerator() | sort -Property Key%0A                    return $ordered_vms%0A                }%0A                "sequence groups:"%0A                foreach ($group in $ordered_vms) {%0A                    $group.Name%0A                    foreach ($vm in $group.Value) { %0A                        $vm%0A                    }%0A                    ""%0A                }%0A                %0A                # iterate over vms%0A                foreach ($group in $ordered_vms) {%0A                    # there is duplication because i wasted too much time trying to put -parallel as a variable and splatting in. Powershell problems...%0A                    # 'Splatting is not permitted in workflow activities or in calls to workflows'%0A                    if ($group.Key -match '_series$') {%0A                        foreach ($vm in $group.Value) { %0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # start vm%0A                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm%0A            %0A                                # update monitoring tag%0A                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                                $tags.not_monitored = "false"%0A                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force%0A                            } %0A                        }%0A                    } else {%0A                        foreach -parallel ($vm in $group.Value) {%0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # start vm%0A                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm%0A            %0A                                # update monitoring tag%0A                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                                $tags.not_monitored = "false"%0A                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force %0A                            }              %0A                        }%0A                    }%0A                    # add delay between groups%0A                    Start-Sleep -Seconds $delayBetweenGroups%0A                }%0A            }%0A        EOT%0A      + id                      = (known after apply)%0A      + job_schedule            = (known after apply)%0A      + location                = "ukwest"%0A      + log_progress            = true%0A      + log_verbose             = true%0A      + name                    = "start-vms"%0A      + resource_group_name     = "t1-prisonnomis"%0A      + runbook_type            = "PowerShellWorkflow"%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["stop-vms"] will be created%0A  + resource "azurerm_automation_runbook" "runbooks" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + content                 = <<-EOT%0A            workflow stop-vms%0A            {%0A                # vars%0A                $resourceGroup = "t1-prisonnomis"%0A                $sequence_tag  = 'sequence_stop'%0A                $delayBetweenGroups = "180"%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A                $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup%0A                %0A                # remove exceptions from vm list by shutdown_exclude tag%0A                $vms_to_handle = InlineScript {%0A                    $vms_in_rg = $using:vms_in_rg%0A                    $vms_to_handle = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_in_rg) {%0A                        if ($vm.Tags.shutdown_exclude -ne 'true') {%0A                            $vms_to_handle += $vm%0A                        }%0A                    }%0A                    return $vms_to_handle%0A                }%0A                "vms to handle:"%0A                $vms_to_handle.Name%0A                ""%0A            %0A                # create ordering groups%0A                $ordered_vms = InlineScript {%0A                    $vms_to_handle = $using:vms_to_handle%0A                    $sequence_tag  = $using:sequence_tag%0A                    # add groups%0A                    $ordered_vms = [ordered]@{}%0A                    $ordered_vms['0'] = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] = [System.Collections.ArrayList]@()%0A                        }%0A                    }%0A                    # add vms into groups%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] += $vm.Name%0A                        } else {%0A                            $ordered_vms['0'] += $vm.Name%0A                        }%0A                    }%0A            %0A                    # sort groups%0A                    $ordered_vms = $ordered_vms.GetEnumerator() | sort -Property Key%0A                    return $ordered_vms%0A                }%0A                "sequence groups:"%0A                foreach ($group in $ordered_vms) {%0A                    $group.Name%0A                    foreach ($vm in $group.Value) { %0A                        $vm%0A                    }%0A                    ""%0A                }%0A            %0A                # iterate over vms%0A                foreach ($group in $ordered_vms) {%0A                    # there is duplication because i wasted too much time trying to put -parallel as a variable and splatting in. Powershell problems...%0A                    # 'Splatting is not permitted in workflow activities or in calls to workflows'%0A                    if ($group.Key -match '_series$') {%0A                        foreach ($vm in $group.Value) { %0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # update monitoring tag if it exists%0A                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                                $tags.not_monitored = "true"%0A                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force %0A            %0A                                # stop vm%0A                                Stop-AzureRmVM -ResourceGroupName $ResourceGroup -Name $vm -Force%0A                            }%0A                        }%0A                    } else {%0A                        foreach -parallel ($vm in $group.Value) {%0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # update monitoring tag if it exists%0A                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                                $tags.not_monitored = "true"%0A                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force %0A            %0A                                # stop vm%0A                                Stop-AzureRmVM -ResourceGroupName $ResourceGroup -Name $vm -Force%0A                            }%0A                        }%0A                    }%0A                    # add delay between groups%0A                    Start-Sleep -Seconds $delayBetweenGroups%0A                }%0A            }%0A        EOT%0A      + id                      = (known after apply)%0A      + job_schedule            = (known after apply)%0A      + location                = "ukwest"%0A      + log_progress            = true%0A      + log_verbose             = true%0A      + name                    = "stop-vms"%0A      + resource_group_name     = "t1-prisonnomis"%0A      + runbook_type            = "PowerShellWorkflow"%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_schedule.schedules["weekdays 6am"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 6am"%0A      + resource_group_name     = "t1-prisonnomis"%0A      + start_time              = (known after apply)%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 7pm"%0A      + resource_group_name     = "t1-prisonnomis"%0A      + start_time              = (known after apply)%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_account.automation_account will be updated in-place%0A  ~ resource "azurerm_automation_account" "automation_account" {%0A        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account"%0A        name                     = "t2-oasys-automation-account"%0A      ~ tags                     = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0APlan: 7 to add, 3 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
::set-output name=stdout::Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.automation_account["nomis-bip-t1"].azurerm_automation_account.automation_account will be updated in-place%0A  ~ resource "azurerm_automation_account" "automation_account" {%0A        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/nomis-bip-t1/providers/Microsoft.Automation/automationAccounts/nomis-bip-t1-automation-account"%0A        name                     = "nomis-bip-t1-automation-account"%0A      ~ tags                     = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-oasys"].azurerm_automation_account.automation_account will be updated in-place%0A  ~ resource "azurerm_automation_account" "automation_account" {%0A        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t1-oasys/providers/Microsoft.Automation/automationAccounts/t1-oasys-automation-account"%0A        name                     = "t1-oasys-automation-account"%0A      ~ tags                     = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_account.automation_account will be created%0A  + resource "azurerm_automation_account" "automation_account" {%0A      + dsc_primary_access_key   = (known after apply)%0A      + dsc_secondary_access_key = (known after apply)%0A      + dsc_server_endpoint      = (known after apply)%0A      + id                       = (known after apply)%0A      + location                 = "ukwest"%0A      + name                     = "t1-prisonnomis-automation-account"%0A      + resource_group_name      = "t1-prisonnomis"%0A      + sku_name                 = "Basic"%0A      + tags                     = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_job_schedule.job_schedules["0"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t1-prisonnomis"%0A      + runbook_name            = "start-vms"%0A      + schedule_name           = "weekdays 6am"%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_job_schedule.job_schedules["1"] will be created%0A  + resource "azurerm_automation_job_schedule" "job_schedules" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + id                      = (known after apply)%0A      + job_schedule_id         = (known after apply)%0A      + resource_group_name     = "t1-prisonnomis"%0A      + runbook_name            = "stop-vms"%0A      + schedule_name           = "weekdays 7pm"%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["start-vms"] will be created%0A  + resource "azurerm_automation_runbook" "runbooks" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + content                 = <<-EOT%0A            workflow start-vms%0A            {   %0A                # vars%0A                $resourceGroup = "t1-prisonnomis"%0A                $sequence_tag  = 'sequence_start'%0A                $delayBetweenGroups = "180"%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A                $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup%0A                %0A                # remove exceptions from vm list by shutdown_exclude tag%0A                $vms_to_handle = InlineScript {%0A                    $vms_in_rg = $using:vms_in_rg%0A                    $vms_to_handle = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_in_rg) {%0A                        if ($vm.Tags.shutdown_exclude -ne 'true') {%0A                            $vms_to_handle += $vm%0A                        }%0A                    }%0A                    return $vms_to_handle%0A                }%0A                "vms to handle:"%0A                $vms_to_handle.Name%0A                ""%0A            %0A                # create ordering groups%0A                $ordered_vms = InlineScript {%0A                    $vms_to_handle = $using:vms_to_handle%0A                    $sequence_tag  = $using:sequence_tag%0A                    # add groups%0A                    $ordered_vms = [ordered]@{}%0A                    $ordered_vms['0'] = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] = [System.Collections.ArrayList]@()%0A                        }%0A                    }%0A                    # add vms into groups%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] += $vm.Name%0A                        } else {%0A                            $ordered_vms['0'] += $vm.Name%0A                        }%0A                    }%0A            %0A                    # sort groups%0A                    $ordered_vms = $ordered_vms.GetEnumerator() | sort -Property Key%0A                    return $ordered_vms%0A                }%0A                "sequence groups:"%0A                foreach ($group in $ordered_vms) {%0A                    $group.Name%0A                    foreach ($vm in $group.Value) { %0A                        $vm%0A                    }%0A                    ""%0A                }%0A                %0A                # iterate over vms%0A                foreach ($group in $ordered_vms) {%0A                    # there is duplication because i wasted too much time trying to put -parallel as a variable and splatting in. Powershell problems...%0A                    # 'Splatting is not permitted in workflow activities or in calls to workflows'%0A                    if ($group.Key -match '_series$') {%0A                        foreach ($vm in $group.Value) { %0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # start vm%0A                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm%0A            %0A                                # update monitoring tag%0A                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                                $tags.not_monitored = "false"%0A                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force%0A                            } %0A                        }%0A                    } else {%0A                        foreach -parallel ($vm in $group.Value) {%0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # start vm%0A                                Start-AzureRmVM -ResourceGroupName $resourceGroup -Name $vm%0A            %0A                                # update monitoring tag%0A                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                                $tags.not_monitored = "false"%0A                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force %0A                            }              %0A                        }%0A                    }%0A                    # add delay between groups%0A                    Start-Sleep -Seconds $delayBetweenGroups%0A                }%0A            }%0A        EOT%0A      + id                      = (known after apply)%0A      + job_schedule            = (known after apply)%0A      + location                = "ukwest"%0A      + log_progress            = true%0A      + log_verbose             = true%0A      + name                    = "start-vms"%0A      + resource_group_name     = "t1-prisonnomis"%0A      + runbook_type            = "PowerShellWorkflow"%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_runbook.runbooks["stop-vms"] will be created%0A  + resource "azurerm_automation_runbook" "runbooks" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + content                 = <<-EOT%0A            workflow stop-vms%0A            {%0A                # vars%0A                $resourceGroup = "t1-prisonnomis"%0A                $sequence_tag  = 'sequence_stop'%0A                $delayBetweenGroups = "180"%0A                %0A                # login - need to have managed identity for this to work https://docs.microsoft.com/en-us/azure/automation/enable-managed-identity-for-automation%0A                Connect-AzureRMAccount -Identity%0A            %0A                # get vm list%0A                $vms_in_rg = Get-AzureRmVM -ResourceGroupName $resourceGroup%0A                %0A                # remove exceptions from vm list by shutdown_exclude tag%0A                $vms_to_handle = InlineScript {%0A                    $vms_in_rg = $using:vms_in_rg%0A                    $vms_to_handle = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_in_rg) {%0A                        if ($vm.Tags.shutdown_exclude -ne 'true') {%0A                            $vms_to_handle += $vm%0A                        }%0A                    }%0A                    return $vms_to_handle%0A                }%0A                "vms to handle:"%0A                $vms_to_handle.Name%0A                ""%0A            %0A                # create ordering groups%0A                $ordered_vms = InlineScript {%0A                    $vms_to_handle = $using:vms_to_handle%0A                    $sequence_tag  = $using:sequence_tag%0A                    # add groups%0A                    $ordered_vms = [ordered]@{}%0A                    $ordered_vms['0'] = [System.Collections.ArrayList]@()%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] = [System.Collections.ArrayList]@()%0A                        }%0A                    }%0A                    # add vms into groups%0A                    foreach ($vm in $vms_to_handle) {%0A                        if ($vm.Tags[$sequence_tag] -match '^\d+') {%0A                            $ordered_vms[$vm.Tags[$sequence_tag]] += $vm.Name%0A                        } else {%0A                            $ordered_vms['0'] += $vm.Name%0A                        }%0A                    }%0A            %0A                    # sort groups%0A                    $ordered_vms = $ordered_vms.GetEnumerator() | sort -Property Key%0A                    return $ordered_vms%0A                }%0A                "sequence groups:"%0A                foreach ($group in $ordered_vms) {%0A                    $group.Name%0A                    foreach ($vm in $group.Value) { %0A                        $vm%0A                    }%0A                    ""%0A                }%0A            %0A                # iterate over vms%0A                foreach ($group in $ordered_vms) {%0A                    # there is duplication because i wasted too much time trying to put -parallel as a variable and splatting in. Powershell problems...%0A                    # 'Splatting is not permitted in workflow activities or in calls to workflows'%0A                    if ($group.Key -match '_series$') {%0A                        foreach ($vm in $group.Value) { %0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # update monitoring tag if it exists%0A                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                                $tags.not_monitored = "true"%0A                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force %0A            %0A                                # stop vm%0A                                Stop-AzureRmVM -ResourceGroupName $ResourceGroup -Name $vm -Force%0A                            }%0A                        }%0A                    } else {%0A                        foreach -parallel ($vm in $group.Value) {%0A                            InlineScript {%0A                                $vm            = $Using:vm%0A                                $resourceGroup = $Using:resourceGroup%0A            %0A                                # update monitoring tag if it exists%0A                                $tags = (Get-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm).Tags%0A                                $tags.not_monitored = "true"%0A                                Set-AzureRmResource -ResourceGroupName $resourceGroup -Name $vm -ResourceType "Microsoft.Compute/VirtualMachines" -Tag $tags -Force %0A            %0A                                # stop vm%0A                                Stop-AzureRmVM -ResourceGroupName $ResourceGroup -Name $vm -Force%0A                            }%0A                        }%0A                    }%0A                    # add delay between groups%0A                    Start-Sleep -Seconds $delayBetweenGroups%0A                }%0A            }%0A        EOT%0A      + id                      = (known after apply)%0A      + job_schedule            = (known after apply)%0A      + location                = "ukwest"%0A      + log_progress            = true%0A      + log_verbose             = true%0A      + name                    = "stop-vms"%0A      + resource_group_name     = "t1-prisonnomis"%0A      + runbook_type            = "PowerShellWorkflow"%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_schedule.schedules["weekdays 6am"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 6am"%0A      + resource_group_name     = "t1-prisonnomis"%0A      + start_time              = (known after apply)%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0A  # module.automation_account["t1-prisonnomis"].azurerm_automation_schedule.schedules["weekdays 7pm"] will be created%0A  + resource "azurerm_automation_schedule" "schedules" {%0A      + automation_account_name = "t1-prisonnomis-automation-account"%0A      + expiry_time             = (known after apply)%0A      + frequency               = "week"%0A      + id                      = (known after apply)%0A      + interval                = (known after apply)%0A      + name                    = "weekdays 7pm"%0A      + resource_group_name     = "t1-prisonnomis"%0A      + start_time              = (known after apply)%0A      + timezone                = "UTC"%0A      + week_days               = [%0A          + "Friday",%0A          + "Monday",%0A          + "Thursday",%0A          + "Tuesday",%0A          + "Wednesday",%0A        ]%0A    }%0A%0A  # module.automation_account["t2-oasys"].azurerm_automation_account.automation_account will be updated in-place%0A  ~ resource "azurerm_automation_account" "automation_account" {%0A        id                       = "/subscriptions/b1f3cebb-4988-4ff9-9259-f02ad7744fcb/resourceGroups/t2-oasys/providers/Microsoft.Automation/automationAccounts/t2-oasys-automation-account"%0A        name                     = "t2-oasys-automation-account"%0A      ~ tags                     = {%0A          + "infrastructure_support" = "DSO:digital-studio-operations-team@digital.justice.gov.uk"%0A          + "source_code"            = "https://github.com/ministryofjustice/dso-azure-automation-accounts"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0APlan: 7 to add, 3 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "plan"%0AReleasing state lock. This may take a few moments...%0A
::set-output name=stderr::
::set-output name=exitcode::0
```